//================================================================
//                    REMOVABLE INSTRUCTIONS
//================================================================
const swup = new Swup();
//================================================================
//                    LOG IN LISTENERS
//================================================================

setChacheInfo();
//Добавляет входные данные из хранилища
$('.login form input[type="button"]').on('click', loginValidationLabel);
//Обработчик правильности ввода; Выводит надписи
$('.login form input[type="button"]').on('click', loginIfValidInput);
//Перекидывает на главную страницу если данные корректны

//================================================================
//                    MAIN PAGE LISTENERS
//================================================================
parallaxMainPage();
//Запускает паралакс на главной странице
$('.mainPage .hat .burger').on('click', showBurgerMenu);

//================================================================
//                    BURGER MENU LISTENERS
//================================================================
